Tekla Open API Reference for Tekla Structures 2025
SaveLoad.SaveLoadText Property
 Gets the currently selected file name in the Save/Load combo box.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SaveLoadText { get; }
Public ReadOnly Property SaveLoadText As String
	Get
Property Value
Type: String
See Also
Reference
SaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace